nxp-mcuxpresso/mcux-soc-svd/MCXA556/MCXA556.xml
        <register>
          <name>P3STAT</name>
          <description>Port Status</description>
          <addressOffset>0x164</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RDSTAT</name>
              <description>Host Read Data Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>rdstat0</name>
                  <description>Endpoint or index-and-data: Empty. Mailbox: Empty (host read to end). Master/Flash: No requests.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rdstat1</name>
                  <description>Endpoint or index-and-data: Data waiting from MCU. Mailbox: Started (by MCU). Master/Flash: Started. From-host: goes to Pending next. To-host: goes to Complete next. SAF: host made request: Started.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rdstat2</name>
                  <description>Mailbox: Complete (by MCU). Master/Flash: Complete. SAF: Complete.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rdstat3</name>
                  <description>Mailbox: Partially read (by host). Master/Flash: From-host only, Pending (request made); goes to Complete next. SAF: MCU has setup completion.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WRSTAT</name>
              <description>Status of Host Writes</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>wrstat0</name>
                  <description>Endpoint: Empty. Index-and-data: Empty. Mailbox: Empty. Master/flash: Not last request.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wrstat1</name>
                  <description>Endpoint: data waiting from host. Index-and-data: data waiting from host (index may have been written before). Mailbox: Started (by host). Master/flash: last request from-host/read-flash (writes to MCU). SAF: Request from master was or is Flash Read.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wrstat2</name>
                  <description>Endpoint: Empty, but last was CMD. Index-and-data: wrote index. Mailbox: complete/last (host to end). Master/flash: last request to-host/write-flash (read from MCU). SAF: Request from Master was or is Flash Write.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wrstat3</name>
                  <description>Endpoint: CMD waiting from host. Index-and-data: Wrote Data then Index. Mailbox: Partially read (by MCU). Flash: Last Requested Erase. SAF: Request from Master was or is Flash Erase.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTERR</name>
              <description>Interrupt Caused by Error</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTRD</name>
              <description>Interrupt Caused by Read</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTWR</name>
              <description>Interrupt Caused by Write</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTSPC0</name>
              <description>SPC0 Interrupt</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTSPC1</name>
              <description>SPC1 Interrupt</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTSPC2</name>
              <description>SPC2 Interrupt</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSTSPC3</name>
              <description>SPC3 Interrupt</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERR0</name>
              <description>Error 0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ERR1</name>
              <description>Error 1</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ERR2</name>
              <description>Error 2</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ERR3</name>
              <description>Error 3</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RPMC_1_OR_2</name>
              <description>RPMC 1 or 2</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OPERATION_0</name>
                  <description>RPMC operation 1 has been chosen</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPERATION_1</name>
                  <description>RPMC operation 2 has been chosen</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RPMC_FLASH_DEVICE</name>
              <description>RPMC Flash Device</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIRST</name>
                  <description>First device</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECOND</name>
                  <description>Second device</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THIRD</name>
                  <description>Third device</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOURTH</name>
                  <description>Fourth device</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>P3IRULESTAT</name>
          <description>Set Interrupt Rules and User Status</description>
          <addressOffset>0x168</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x600000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USTAT</name>
              <description>User-Defined Status Bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTERR</name>
              <description>Interrupt If Error Detected</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTRD</name>
              <description>Interrupt If Read or First Read or Bus Master Started</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTWR</name>
              <description>Interrupt If Write or First Write or Bus Master Finished</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTSPC</name>
              <description>Select Interrupts for PnSTAT[INTSPC0] through PnSTAT[INSTSPC3]</description>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SSTCL</name>
              <description>Status Set and Clear</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SRST</name>
              <description>Reset PnSTAT[RDSTAT] and PnSTAT[WRSTAT]</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FLASH_COMPLETION_TYPE</name>
              <description>Flash Completion Type</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MIDDLE</name>
                  <description>Indicates the middle completion of a split completion sequence</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRST</name>
                  <description>Indicates the first completion of a split completion sequence</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAST</name>
                  <description>Indicates the last completion of a split completion sequence</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONLY</name>
                  <description>Indicates the only completion for a split transaction.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPU_TAG</name>
              <description>CPU Tag</description>
              <bitOffset>23</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P3ADDR</name>
          <description>Port Address</description>
          <alternateGroup>PADDR</alternateGroup>
          <addressOffset>0x16C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OFF</name>
              <description>Offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BASE_ASZ</name>
              <description>The meaning is dependent on type of port:</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFFSET_FROM_0</name>
                  <description>Offset from 0 in host memory or I/O space.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_BASE0</name>
                  <description>Uses BASE0 offset in host memory</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_BASE1</name>
                  <description>Uses BASE1 offset in host memory</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IDXOFF</name>
              <description>Index Offset</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDX1ST</name>
              <description>For index-and-data register only:</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dataoff</name>
                  <description>Index is higher address than data (for example, data at OFF, index at OFF+IDXOFF)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>idxoff</name>
                  <description>Index is lower address than data (for example, index at OFF, data at OFF+IDXOFF)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>P3OMFLEN</name>
          <description>Port OOB, Mastering, and Flash Length</description>
          <alternateGroup>POMFLEN</alternateGroup>
          <addressOffset>0x16C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEN</name>
              <description>Length in Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRANS</name>
              <description>Transfer Request</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>oob</name>
                  <description>OOB: to host; Master: to host 32 (host reads with 32-bit address); SAF: Completion fail</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read</name>
                  <description>Master: to host 64 (host reads w/64-bit address); MAF: read flash (location in RAM); SAF: completion with data</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>write</name>
                  <description>Master: from host 32 (host writes w/32-bit address); MAF: write flash (location in RAM); SAF: completion with no data</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>erase</name>
                  <description>Master: from host 64 (host writes w/64-bit address); MAF: erase flash (sector in RAM)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>P3DATAIN</name>
          <description>Port Data Input</description>
          <addressOffset>0x170</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_LEN</name>
              <description>Data Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIR</name>
              <description>Direction of last access</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Read by host</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Write by host</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IDX</name>
              <description>Index of Last Access</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P3DATAOUT</name>
          <description>Port Data Out</description>
          <alternateGroup>PDATAOUT</alternateGroup>
          <addressOffset>0x174</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data to Send to Host</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P3RAMUSE</name>
          <description>Port RAM Use</description>
          <alternateGroup>PRAMUSE</alternateGroup>
          <addressOffset>0x174</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OFF</name>
              <description>Offset into RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEN</name>
              <description>Length</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
