nxp-mcuxpresso/mcux-soc-svd/MCXA556/MCXA556.xml
        <register>
          <name>STS1</name>
          <description>Status 1</description>
          <addressOffset>0xE4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AHBCMDERRID</name>
              <description>AHB Command Error ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHBCMDERRCODE</name>
              <description>AHB Command Error Code</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>val0</name>
                  <description>No error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val2</name>
                  <description>AHB Write command with JMP_ON_CS instruction used in the sequence</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val3</name>
                  <description>Unknown instruction opcode in the sequence</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val4</name>
                  <description>DUMMY_SDR or DUMMY_RWDS_SDR instruction used in DDR sequence</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val5</name>
                  <description>DUMMY_DDR or DUMMY_RWDS_DDR instruction used in SDR sequence</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val6</name>
                  <description>Sequence execution timeout</description>
                  <value>0xE</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IPCMDERRID</name>
              <description>IP Command Error ID</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IPCMDERRCODE</name>
              <description>IP Command Error Code</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>val0</name>
                  <description>No error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val2</name>
                  <description>IP command with JMP_ON_CS instruction used in the sequence</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val3</name>
                  <description>Unknown instruction opcode in the sequence</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val4</name>
                  <description>DUMMY_SDR or DUMMY_RWDS_SDR instruction used in DDR sequence</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val5</name>
                  <description>DUMMY_DDR or DUMMY_RWDS_DDR instruction used in SDR sequence</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val6</name>
                  <description>Flash memory access start address exceeds entire flash address range (A1, A2, B1, and B2)</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val7</name>
                  <description>Sequence execution timeout</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val8</name>
                  <description>Flash boundary crossed</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STS2</name>
          <description>Status 2</description>
          <addressOffset>0xE8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x1000100</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ASLVLOCK</name>
              <description>Flash A Sample Target Delay Line Locked</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>val0</name>
                  <description>Not locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val1</name>
                  <description>Locked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AREFLOCK</name>
              <description>Flash A Sample Clock Reference Delay Line Locked</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>val0</name>
                  <description>Not locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val1</name>
                  <description>Locked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ASLVSEL</name>
              <description>Flash A Sample Clock Target Delay Line Delay Cell Number</description>
              <bitOffset>2</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AREFSEL</name>
              <description>Flash A Sample Clock Reference Delay Line Delay Cell Number</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AREF_ONE_HOT_ERR</name>
              <description>Delay Cell number of Flash A Reference Delay Line indication is not one-hot.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>val0</name>
                  <description>Error occurred</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val1</name>
                  <description>No error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AREF_ALL_ZERO_ERR</name>
              <description>Delay Cell number of Flash A Reference Delay Line indication is all zero.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>val0</name>
                  <description>Error occurred</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val1</name>
                  <description>No error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BSLVLOCK</name>
              <description>Flash B Sample Target Reference Delay Line Locked</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>val0</name>
                  <description>Not locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val1</name>
                  <description>Locked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BREFLOCK</name>
              <description>Flash B Sample Clock Reference Delay Line Locked</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>val0</name>
                  <description>Not locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val1</name>
                  <description>Locked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BSLVSEL</name>
              <description>Flash B Sample Clock Target Delay Line Delay Cell Number</description>
              <bitOffset>18</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BREFSEL</name>
              <description>Flash B Sample Clock Reference Delay Line Delay Cell Number</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BREF_ONE_HOT_ERR</name>
              <description>Delay Cell number of Flash B Reference Delay Line indication is not one-hot.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>val0</name>
                  <description>Error occurred</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val1</name>
                  <description>No error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BREF_ALL_ZERO_ERR</name>
              <description>Delay Cell number of Flash B Reference Delay Line indication is all zero.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>val0</name>
                  <description>Error occurred</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val1</name>
                  <description>No error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBSPNDSTS</name>
          <description>AHB Suspend Status</description>
          <addressOffset>0xEC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ACTIVE</name>
              <description>Active AHB Read Prefetch Suspended</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>val0</name>
                  <description>No suspended AHB read prefetch command.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val1</name>
                  <description>An AHB read prefetch command sequence has been suspended.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BUFID</name>
              <description>AHB Receive Buffer ID for Suspended Command Sequence</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DATLFT</name>
              <description>Data Left</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPRXFSTS</name>
          <description>IP Receive FIFO Status</description>
          <addressOffset>0xF0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FILL</name>
              <description>Fill Level of IP Receive FIFO</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RDCNTR</name>
              <description>Read Data Counter</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPTXFSTS</name>
          <description>IP Transmit FIFO Status</description>
          <addressOffset>0xF4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FILL</name>
              <description>Fill Level of IP Transmit FIFO</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WRCNTR</name>
              <description>Write Data Counter</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>32</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>RFDR[%s]</name>
          <description>IP Receive FIFO Data x</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RXDATA</name>
              <description>Receive Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>32</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TFDR[%s]</name>
          <description>IP TX FIFO Data x</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXDATA</name>
              <description>Transmit Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>64</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>LUT[%s]</name>
          <description>Lookup Table x</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>OPERAND0</name>
              <description>OPERAND0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NUM_PADS0</name>
              <description>NUM_PADS0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OPCODE0</name>
              <description>OPCODE</description>
              <bitOffset>10</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OPERAND1</name>
              <description>OPERAND1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NUM_PADS1</name>
              <description>NUM_PADS1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OPCODE1</name>
              <description>OPCODE1</description>
              <bitOffset>26</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HADDRSTART</name>
          <description>HADDR REMAP Start Address</description>
          <addressOffset>0x420</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REMAPEN</name>
              <description>AHB Bus Address Remap Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>val0</name>
                  <description>HADDR REMAP Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val1</name>
                  <description>HADDR REMAP Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWAPEN</name>
              <description>AHB or IP Bus Address Swap Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDRSTART</name>
              <description>HADDR Start Address</description>
              <bitOffset>12</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HADDREND</name>
          <description>HADDR REMAP END ADDR</description>
          <addressOffset>0x424</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENDSTART</name>
              <description>End Address of HADDR Remap Range</description>
              <bitOffset>12</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HADDROFFSET</name>
          <description>HADDR Remap Offset</description>
          <addressOffset>0x428</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDROFFSET</name>
              <description>HADDR Offset</description>
              <bitOffset>12</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
