nxp-mcuxpresso/mcux-soc-svd/MCXA556/MCXA556.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>NVIC</name>
      <description>Nested Vectored Interrupt Controller</description>
      <groupName>NVIC</groupName>
      <baseAddress>0xE000E100</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xE04</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>Reserved16</name>
        <value>0</value>
      </interrupt>
      <interrupt>
        <name>CMC</name>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>DMA0_CH0</name>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>DMA0_CH1</name>
        <value>3</value>
      </interrupt>
      <interrupt>
        <name>DMA0_CH2</name>
        <value>4</value>
      </interrupt>
      <interrupt>
        <name>DMA0_CH3</name>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>DMA0_CH4</name>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>DMA0_CH5</name>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>DMA0_CH6</name>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>DMA0_CH7</name>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>ERM0_SINGLE_BIT</name>
        <value>10</value>
      </interrupt>
      <interrupt>
        <name>ERM0_MULTI_BIT</name>
        <value>11</value>
      </interrupt>
      <interrupt>
        <name>FMU0</name>
        <value>12</value>
      </interrupt>
      <interrupt>
        <name>GLIKEY0</name>
        <value>13</value>
      </interrupt>
      <interrupt>
        <name>MBC0</name>
        <value>14</value>
      </interrupt>
      <interrupt>
        <name>SCG0</name>
        <value>15</value>
      </interrupt>
      <interrupt>
        <name>SPC0</name>
        <value>16</value>
      </interrupt>
      <interrupt>
        <name>TDET</name>
        <value>17</value>
      </interrupt>
      <interrupt>
        <name>WUU0</name>
        <value>18</value>
      </interrupt>
      <interrupt>
        <name>Reserved35</name>
        <value>19</value>
      </interrupt>
      <interrupt>
        <name>Reserved36</name>
        <value>20</value>
      </interrupt>
      <interrupt>
        <name>FLEXIO</name>
        <value>23</value>
      </interrupt>
      <interrupt>
        <name>I3C0</name>
        <value>24</value>
      </interrupt>
      <interrupt>
        <name>I3C1</name>
        <value>25</value>
      </interrupt>
      <interrupt>
        <name>LPI2C0</name>
        <value>26</value>
      </interrupt>
      <interrupt>
        <name>LPI2C1</name>
        <value>27</value>
      </interrupt>
      <interrupt>
        <name>LPSPI0</name>
        <value>28</value>
      </interrupt>
      <interrupt>
        <name>LPSPI1</name>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>LPSPI2</name>
        <value>30</value>
      </interrupt>
      <interrupt>
        <name>LPUART0</name>
        <value>31</value>
      </interrupt>
      <interrupt>
        <name>LPUART1</name>
        <value>32</value>
      </interrupt>
      <interrupt>
        <name>LPUART2</name>
        <value>33</value>
      </interrupt>
      <interrupt>
        <name>LPUART3</name>
        <value>34</value>
      </interrupt>
      <interrupt>
        <name>LPUART4</name>
        <value>35</value>
      </interrupt>
      <interrupt>
        <name>CDOG0</name>
        <value>38</value>
      </interrupt>
      <interrupt>
        <name>CTIMER0</name>
        <value>39</value>
      </interrupt>
      <interrupt>
        <name>CTIMER1</name>
        <value>40</value>
      </interrupt>
      <interrupt>
        <name>CTIMER2</name>
        <value>41</value>
      </interrupt>
      <interrupt>
        <name>CTIMER3</name>
        <value>42</value>
      </interrupt>
      <interrupt>
        <name>CTIMER4</name>
        <value>43</value>
      </interrupt>
      <interrupt>
        <name>FREQME0</name>
        <value>54</value>
      </interrupt>
      <interrupt>
        <name>LPTMR0</name>
        <value>55</value>
      </interrupt>
      <interrupt>
        <name>OS_EVENT</name>
        <value>57</value>
      </interrupt>
      <interrupt>
        <name>WAKETIMER0</name>
        <value>58</value>
      </interrupt>
      <interrupt>
        <name>UTICK0</name>
        <value>59</value>
      </interrupt>
      <interrupt>
        <name>WWDT0</name>
        <value>60</value>
      </interrupt>
      <interrupt>
        <name>WWDT1</name>
        <value>61</value>
      </interrupt>
      <interrupt>
        <name>ADC0</name>
        <value>62</value>
      </interrupt>
      <interrupt>
        <name>ADC1</name>
        <value>63</value>
      </interrupt>
      <interrupt>
        <name>CMP0</name>
        <value>64</value>
      </interrupt>
      <interrupt>
        <name>Reserved83</name>
        <value>67</value>
      </interrupt>
      <interrupt>
        <name>Reserved84</name>
        <value>68</value>
      </interrupt>
      <interrupt>
        <name>GPIO0</name>
        <value>71</value>
      </interrupt>
      <interrupt>
        <name>GPIO1</name>
        <value>72</value>
      </interrupt>
      <interrupt>
        <name>GPIO2</name>
        <value>73</value>
      </interrupt>
      <interrupt>
        <name>GPIO3</name>
        <value>74</value>
      </interrupt>
      <interrupt>
        <name>GPIO4</name>
        <value>75</value>
      </interrupt>
      <interrupt>
        <name>GPIO5</name>
        <value>76</value>
      </interrupt>
      <interrupt>
        <name>LPI2C2</name>
        <value>77</value>
      </interrupt>
      <interrupt>
        <name>LPI2C3</name>
        <value>78</value>
      </interrupt>
      <interrupt>
        <name>ESPI</name>
        <value>89</value>
      </interrupt>
      <interrupt>
        <name>ETHERNET</name>
        <value>90</value>
      </interrupt>
      <interrupt>
        <name>ETHERNET_PMT</name>
        <value>91</value>
      </interrupt>
      <interrupt>
        <name>Reserved109</name>
        <value>93</value>
      </interrupt>
      <interrupt>
        <name>I3C2</name>
        <value>94</value>
      </interrupt>
      <interrupt>
        <name>LPUART5</name>
        <value>95</value>
      </interrupt>
      <interrupt>
        <name>LPSPI3</name>
        <value>97</value>
      </interrupt>
      <interrupt>
        <name>LPSPI4</name>
        <value>98</value>
      </interrupt>
      <interrupt>
        <name>LPSPI5</name>
        <value>99</value>
      </interrupt>
      <interrupt>
        <name>LPI2C4</name>
        <value>100</value>
      </interrupt>
      <interrupt>
        <name>I3C3</name>
        <value>101</value>
      </interrupt>
      <interrupt>
        <name>USB1_HS</name>
        <value>103</value>
      </interrupt>
      <interrupt>
        <name>USB1_HS_PHY</name>
        <value>104</value>
      </interrupt>
      <interrupt>
        <name>FLEXSPI0</name>
        <value>106</value>
      </interrupt>
      <interrupt>
        <name>SMARTDMA</name>
        <value>108</value>
      </interrupt>
      <interrupt>
        <name>CDOG1</name>
        <value>109</value>
      </interrupt>
      <interrupt>
        <name>PKC</name>
        <value>110</value>
      </interrupt>
      <interrupt>
        <name>SGI</name>
        <value>111</value>
      </interrupt>
      <interrupt>
        <name>Reserved128</name>
        <value>112</value>
      </interrupt>
      <interrupt>
        <name>TRNG0</name>
        <value>113</value>
      </interrupt>
      <interrupt>
        <name>SECURE_ERR</name>
        <value>114</value>
      </interrupt>
      <interrupt>
        <name>SEC_HYPERVISOR_CALL</name>
        <value>115</value>
      </interrupt>
      <interrupt>
        <name>RTC</name>
        <value>119</value>
      </interrupt>
      <interrupt>
        <name>DGDET0</name>
        <value>122</value>
      </interrupt>
      <interrupt>
        <name>EWM</name>
        <value>123</value>
      </interrupt>
      <interrupt>
        <name>Reserved140</name>
        <value>124</value>
      </interrupt>
      <interrupt>
        <name>Reserved141</name>
        <value>125</value>
      </interrupt>
      <interrupt>
        <name>GPIO0_1</name>
        <value>126</value>
      </interrupt>
      <interrupt>
        <name>GPIO1_1</name>
        <value>127</value>
      </interrupt>
      <interrupt>
        <name>GPIO2_1</name>
        <value>128</value>
      </interrupt>
      <interrupt>
        <name>GPIO3_1</name>
        <value>129</value>
      </interrupt>
      <interrupt>
        <name>GPIO4_1</name>
        <value>130</value>
      </interrupt>
      <interrupt>
        <name>GPIO5_1</name>
        <value>131</value>
      </interrupt>
      <interrupt>
        <name>ITRC0</name>
        <value>133</value>
      </interrupt>
      <interrupt>
        <name>DMA0_CH8</name>
        <value>134</value>
      </interrupt>
      <interrupt>
        <name>DMA0_CH9</name>
        <value>135</value>
      </interrupt>
      <interrupt>
        <name>DMA0_CH10</name>
        <value>136</value>
      </interrupt>
      <interrupt>
        <name>DMA0_CH11</name>
        <value>137</value>
      </interrupt>
      <interrupt>
        <name>DMA1_CH0</name>
        <value>142</value>
      </interrupt>
      <interrupt>
        <name>DMA1_CH1</name>
        <value>143</value>
      </interrupt>
      <interrupt>
        <name>DMA1_CH2</name>
        <value>144</value>
      </interrupt>
      <interrupt>
        <name>DMA1_CH3</name>
        <value>145</value>
      </interrupt>
      <registers>
        <register>
          <dim>16</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>ISER[%s]</name>
          <description>Interrupt Set Enable Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SETENA0</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA1</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA2</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA3</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA4</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA5</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA6</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA7</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA8</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA9</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA10</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA11</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA12</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA13</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA14</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA15</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA16</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
